# Data structures: pandas et al
* <b>Series</b> is an one-dimensional <b>labeled array</b> for any data type (integers, strings, floating point numbers, Python objects, etc.). The <b>labels</b> are referred to as the <b>index</b>
* Create panda series: pd.Series(data, index=...)

In [50]:
import numpy as np
import pandas as pd

# a series: a one-dimensional labeled array
#s1 = pd.Series([41,2000,4,2,4], index=['age', 'salary', 'id', 'kids', 'rank'])
s1 = pd.Series([41,2000,4,2,4])

print(s1)

0      41
1    2000
2       4
3       2
4       4
dtype: int64

In [51]:
# generate a series of 5 random numbers
s2 = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

#print(s1)
#print("\n\n")
print(s2)

a    1.071121
b   -0.449092
c    0.869174
d   -0.395594
e    0.937118
dtype: float64

* You can create series from dictionaries!

In [52]:
d = {'area': 42, 'year': 2018, 'price': 30000}
s = pd.Series(d)

print(s)

area        42
year      2018
price    30000
dtype: int64

* You can create series from dictionaries, but adding index-labels

In [53]:
d = {'area': 42, 'year': 2018, 'price': 30000}
s = pd.Series(d, index=['area', 'price','year', 'location'])

print(s)

area           42.0
price       30000.0
year         2018.0
location        NaN
dtype: float64

In [54]:
# lets re-initiate s
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
print(s)

a    0.108722
b    1.063488
c    1.417473
d   -1.399666
e   -0.194452
dtype: float64

* Access elements with []

In [58]:
# first element of s
s[0]

0.10872173157889538

In [60]:
s[[0]]

a    0.108722
dtype: float64

In [61]:
s[[0,1]]

a    0.108722
b    1.063488
dtype: float64

In [63]:
# first, second and third elements of s
s[[0,1,2]]

a    0.108722
b    1.063488
c    1.417473
dtype: float64

* Use series as dictionaries, using index as key

In [66]:
# lets re-initiate s
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
print(s)

a    0.995515
b   -0.527247
c    0.004500
d   -1.544350
e   -0.839267
dtype: float64

In [67]:
#you can use series are dictionaries using index as key
# value of key 'c'
print(s['c'])

0.004499900855410445

In [68]:
# assign the value 10 for key 'a'
s['a']=10

print(s)

a    10.000000
b    -0.527247
c     0.004500
d    -1.544350
e    -0.839267
dtype: float64

* Perform batch operations

In [69]:
# multiply all elements by 2
s = s*2
print(s)

a    20.000000
b    -1.054495
c     0.009000
d    -3.088701
e    -1.678534
dtype: float64

# Dataframe
* A dataframe is a 2-dimensional labeled data structure with columns of potentially different types. Think of it as a dict of Series. DataFrame accepts many different kinds of input:
lists, dicts, series, other dataframes, etc..
* Create panda dataframes: pd.Dataframe(...)
* check the indexes!!!

In [70]:
# a dictionary of series
d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']), 'two': pd.Series([6., 4., 5.], index=['a', 'b', 'c'])}

# create a dataframe from a dictionary of series
df = pd.DataFrame(d)
print(df)

   one  two
a  1.0  6.0
b  2.0  4.0
c  3.0  5.0

In [71]:
# a dictionary of series
d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']), 
     'two': pd.Series([6., 4., 5., 4.], index=['a', 'b', 'c', 'd'])}

# create a dataframe from a dictionary of series
df = pd.DataFrame(d)
print(df)

   one  two
a  1.0  6.0
b  2.0  4.0
c  3.0  5.0
d  NaN  4.0

In [75]:
# a dictionary of series
d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']), 
     'two': pd.Series([6., 4., 5., 4.], index=['d', 'e', 'f', 'g'])}

# create a dataframe from a dictionary of series
df = pd.DataFrame(d)
print(df)

   one  two
a  1.0  6.0
b  2.0  4.0
c  3.0  5.0
g  NaN  4.0

* Return index

In [30]:
# return df's indexes

# no need to print! In notebooks you just type the variable to see the result.

df.index

#i = df.index
#print(i)

Index(['a', 'b', 'c', 'd'], dtype='object')

* Return column names

In [84]:
# return df's columns
df.columns

Index(['one', 'two'], dtype='object')

* Create a dataframe from a dictionary of lists

In [85]:
# the dictionary
d = {'one': [1., 2., 3., 4.], 'two': [4., 3., 2., 1.]}

df = pd.DataFrame(d)
print(df)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

* Create a dataframe from a list of dictionaries. Note the automatic fill with NaN values.

In [86]:
# a list of dictionaries
d = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]

pd.DataFrame(d)

   a   b     c
0  1   2   NaN
1  5  10  20.0

* Create a dataframe from a dict of series.

In [31]:
# the dictionary
d = {'one': pd.Series([1., 2., 3., 4.]), 'two': pd.Series([4., 3., 2., 1.])}

df = pd.DataFrame(d)
print(df)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [32]:
# the dictionary, but adding index in series. Note that you have 2 indexes!!!!
d = {'one': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd']), 'two': pd.Series([4., 3., 2., 1.], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
print(df)

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

* access columns using keys (slices)

In [88]:
print(df['two'])

a    4.0
b    3.0
c    2.0
d    1.0
Name: two, dtype: float64

## Read from csv (the power of panda/dataframes)

In [36]:
import pandas as pd

data = pd.read_csv("houseprices.csv", sep=',')
print(data)

     location        type  area  constructionyear  sellingyear  price
0    Zografou  Storehouse   NaN              1974         2018    500
1    Zografou  Storehouse   3.0              2016         2018    469
2    Zografou  Storehouse   4.0              1968         2018    500
3    Zografou  Storehouse   NaN              1974         2018    500
4    Zografou  Storehouse  39.0              1970         2018   5500
..        ...         ...   ...               ...          ...    ...
184  Zografou       House  52.0              1968         2017  25000
185  Zografou       House  71.0              1969         2017  10000
186  Zografou       House  44.0              1972         2017   3500
187  Zografou       House  96.0              1967         2017  50000
188  Zografou       House  34.0              1972         2017  20000

[189 rows x 6 columns]

## First view of data

In [37]:
data.head()

   location        type  area  constructionyear  sellingyear  price
0  Zografou  Storehouse   NaN              1974         2018    500
1  Zografou  Storehouse   3.0              2016         2018    469
2  Zografou  Storehouse   4.0              1968         2018    500
3  Zografou  Storehouse   NaN              1974         2018    500
4  Zografou  Storehouse  39.0              1970         2018   5500

## Which columns?

In [38]:
data.columns.values

array(['location', 'type', 'area', 'constructionyear', 'sellingyear',
       'price'], dtype=object)

## Describe column content

In [39]:
data.describe()

             area  constructionyear  sellingyear          price
count  184.000000        189.000000   189.000000     189.000000
mean    59.483696       1975.862434  2017.232804   31046.317460
std     28.129866         12.692019     0.423741   40442.377241
min      3.000000       1952.000000  2017.000000       0.000000
25%     44.000000       1968.000000  2017.000000   10000.000000
50%     54.000000       1972.000000  2017.000000   20000.000000
75%     76.250000       1979.000000  2017.000000   40000.000000
max    222.000000       2016.000000  2018.000000  342590.000000

## Slices

* Get a specific column, e.g., area

In [40]:
data['price']

0        500
1        469
2        500
3        500
4       5500
       ...
184    25000
185    10000
186     3500
187    50000
188    20000
Name: price, Length: 189, dtype: int64

* Get more columns, e.g., area, price and sellingyear!

In [41]:
data[ ['area','price', 'sellingyear'] ]

     area  price  sellingyear
0     NaN    500         2018
1     3.0    469         2018
2     4.0    500         2018
3     NaN    500         2018
4    39.0   5500         2018
..    ...    ...          ...
184  52.0  25000         2017
185  71.0  10000         2017
186  44.0   3500         2017
187  96.0  50000         2017
188  34.0  20000         2017

[189 rows x 3 columns]

* Get 4 rows, e.g., rows at position 0, 1 and 2 and 5

In [42]:
data.iloc[[0,1,2,5]]

   location        type  area  constructionyear  sellingyear  price
0  Zografou  Storehouse   NaN              1974         2018    500
1  Zografou  Storehouse   3.0              2016         2018    469
2  Zografou  Storehouse   4.0              1968         2018    500
5  Zografou  Storehouse   NaN              1974         2018    500

* set my own index! instead of 0, 1, 2,... put 100, 101, 102...

In [43]:
# create my own column with label myid
data['myid']=range(100, len(data)+100, 1)
data = data.set_index('myid')
print(data)

      location        type  area  constructionyear  sellingyear  price
myid
100   Zografou  Storehouse   NaN              1974         2018    500
101   Zografou  Storehouse   3.0              2016         2018    469
102   Zografou  Storehouse   4.0              1968         2018    500
103   Zografou  Storehouse   NaN              1974         2018    500
104   Zografou  Storehouse  39.0              1970         2018   5500
...        ...         ...   ...               ...          ...    ...
284   Zografou       House  52.0              1968         2017  25000
285   Zografou       House  71.0              1969         2017  10000
286   Zografou       House  44.0              1972         2017   3500
287   Zografou       House  96.0              1967         2017  50000
288   Zografou       House  34.0              1972         2017  20000

[189 rows x 6 columns]

* Get 3 rows, but using their label, not their position!. iloc() vs loc()

In [44]:
data.loc[[100,102,104]]

      location        type  area  constructionyear  sellingyear  price
myid
100   Zografou  Storehouse   NaN              1974         2018    500
102   Zografou  Storehouse   4.0              1968         2018    500
104   Zografou  Storehouse  39.0              1970         2018   5500

* Get all rows with 'price' field <= 50000, using two ways with loc and without loc

In [46]:
data[data['price']<=50000]

      location        type  area  constructionyear  sellingyear  price
myid
100   Zografou  Storehouse   NaN              1974         2018    500
101   Zografou  Storehouse   3.0              2016         2018    469
102   Zografou  Storehouse   4.0              1968         2018    500
103   Zografou  Storehouse   NaN              1974         2018    500
104   Zografou  Storehouse  39.0              1970         2018   5500
...        ...         ...   ...               ...          ...    ...
284   Zografou       House  52.0              1968         2017  25000
285   Zografou       House  71.0              1969         2017  10000
286   Zografou       House  44.0              1972         2017   3500
287   Zografou       House  96.0              1967         2017  50000
288   Zografou       House  34.0              1972         2017  20000

[159 rows x 6 columns]

In [47]:
data.loc[ (data['price'] < 50000) ]

      location        type  area  constructionyear  sellingyear  price
myid
100   Zografou  Storehouse   NaN              1974         2018    500
101   Zografou  Storehouse   3.0              2016         2018    469
102   Zografou  Storehouse   4.0              1968         2018    500
103   Zografou  Storehouse   NaN              1974         2018    500
104   Zografou  Storehouse  39.0              1970         2018   5500
...        ...         ...   ...               ...          ...    ...
283   Zografou       House  20.0              1965         2017  13158
284   Zografou       House  52.0              1968         2017  25000
285   Zografou       House  71.0              1969         2017  10000
286   Zografou       House  44.0              1972         2017   3500
288   Zografou       House  34.0              1972         2017  20000

[155 rows x 6 columns]

* Get all rows with 'area' field > 90 and 'price' < 100000 and 'sellingyear' < 2018

In [48]:
data.loc[ (data['area'] > 90) & (data['price'] < 100000) & (data['sellingyear'] < 2018) ]

      location   type   area  constructionyear  sellingyear  price
myid
162   Zografou  House  113.0              1980         2017  77000
194   Zografou  House   91.0              1974         2017  86000
217   Zografou  House  116.0              1989         2017  35000
219   Zografou  House  116.0              1989         2017  35000
223   Zografou  House   93.0              1978         2017  40000
225   Zografou  House   96.0              1990         2017  40000
249   Zografou  House  107.0              1978         2017    114
251   Zografou  House  113.0              1979         2017  97500
255   Zografou  House   93.0              1952         2017  55000
259   Zografou  House  112.0              1980         2017  55000
287   Zografou  House   96.0              1967         2017  50000

* Drop column sellingyear (1: is for columns, while 0 is for dropping rows)

In [95]:
data.drop('sellingyear', 1)

      location        type  area  constructionyear  price
myid
100   Zografou  Storehouse   NaN              1974    500
101   Zografou  Storehouse   3.0              2016    469
102   Zografou  Storehouse   4.0              1968    500
103   Zografou  Storehouse   NaN              1974    500
104   Zografou  Storehouse  39.0              1970   5500
...        ...         ...   ...               ...    ...
284   Zografou       House  52.0              1968  25000
285   Zografou       House  71.0              1969  10000
286   Zografou       House  44.0              1972   3500
287   Zografou       House  96.0              1967  50000
288   Zografou       House  34.0              1972  20000

[189 rows x 5 columns]

In [96]:
print(data)

      location        type  area  constructionyear  sellingyear  price
myid
100   Zografou  Storehouse   NaN              1974         2018    500
101   Zografou  Storehouse   3.0              2016         2018    469
102   Zografou  Storehouse   4.0              1968         2018    500
103   Zografou  Storehouse   NaN              1974         2018    500
104   Zografou  Storehouse  39.0              1970         2018   5500
...        ...         ...   ...               ...          ...    ...
284   Zografou       House  52.0              1968         2017  25000
285   Zografou       House  71.0              1969         2017  10000
286   Zografou       House  44.0              1972         2017   3500
287   Zografou       House  96.0              1967         2017  50000
288   Zografou       House  34.0              1972         2017  20000

[189 rows x 6 columns]

* Note that the column has not been deleted yet from data! To delete the column without having to reassign data you can use inplace=True

In [97]:
data.drop('sellingyear', 1, inplace =True)
#data = data.drop('sellingyear', 1) # identical to inplace = True
print(data)

      location        type  area  constructionyear  price
myid
100   Zografou  Storehouse   NaN              1974    500
101   Zografou  Storehouse   3.0              2016    469
102   Zografou  Storehouse   4.0              1968    500
103   Zografou  Storehouse   NaN              1974    500
104   Zografou  Storehouse  39.0              1970   5500
...        ...         ...   ...               ...    ...
284   Zografou       House  52.0              1968  25000
285   Zografou       House  71.0              1969  10000
286   Zografou       House  44.0              1972   3500
287   Zografou       House  96.0              1967  50000
288   Zografou       House  34.0              1972  20000

[189 rows x 5 columns]

## Statistics

In [98]:
# sum of all 'price' values

data['price'].sum()

5867754

In [99]:
# avg of all 'price' and 'area' values

data[['price', 'area']].mean()

price    31046.317460
area        59.483696
dtype: float64

In [100]:
# max of all 'price' and 'area' values

data[['price', 'area']].max()

price    342590.0
area        222.0
dtype: float64

In [101]:
# min of all 'price' and 'area' values

data[['price', 'area']].min()

price    0.0
area     3.0
dtype: float64

In [102]:
data.groupby(["type"])['price'].sum()

type
House         5691791
Shophouse      134768
Storehouse      41195
Name: price, dtype: int64